tap 'homebrew/cask-drivers'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

brew 'ack'
brew 'git'
brew 'diff-so-fancy'
brew 'ffmpeg'
brew 'fish'
brew 'fzf'
brew 'gnu-typist'
brew 'htop-osx'
brew 'httpie'
brew 'jq'
brew 'reattach-to-user-namespace'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tmate'
brew 'tmux'
brew 'tmuxinator'
brew 'unrar'
brew 'vim'
brew 'youtube-dl'
brew 'neovim'
brew 'less'
brew 'shellcheck'
brew 'ranger'
brew 'mosh'
brew 'moreutils'
brew 'highlight'
brew 'exa'
brew 'watch'
brew 'mtr'
brew 'bat'
brew 'entr'
brew 'ipython'
brew 'pre-commit'
brew 'fd'
brew 'fasd'
brew 'ccls'
brew 'delta'
brew 'ripgrep'
brew 'isort'
brew 'scrcpy'
brew 'smudge/smudge/nightlight'

# apps
# cask 'arq'
# cask 'karabiner-elements'
# cask 'hammerspoon'
# cask 'bettertouchtool'
# cask 'dbeaver-community'
cask 'vlc'
cask 'transmission'
cask 'docker'
cask 'calibre'
cask 'spotify'
cask 'telegram'
cask 'the-unarchiver'
cask 'virtualbox'
cask 'google-chrome'
cask 'wireshark'
cask 'platypus'
cask 'hex-fiend'
cask 'vimr'
cask 'keepassxc'
cask 'raycast'
cask 'monitorcontrol'

# fonts
cask 'font-inconsolata'
cask 'font-inconsolata-nerd-font'
cask 'font-hack'
cask 'font-hack-nerd-font'
