tap 'burntsushi/ripgrep', 'https://github.com/BurntSushi/ripgrep.git'
tap 'homebrew/cask-drivers'
tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

brew 'ack'
brew 'git'
brew 'bash'
brew 'cask'
brew 'cppcheck'
brew 'ctags'
brew 'diff-so-fancy'
brew 'ffmpeg'
brew 'fish'
brew 'fswatch'
brew 'fzf'
brew 'gcc'
brew 'gnutls'
brew 'gnu-typist'
brew 'gnupg'
brew 'graphviz'
brew 'htop-osx'
brew 'httpie'
brew 'jq'
brew 'mysql'
brew 'netcat'
brew 'openvpn'
brew 'tree'
brew 'postgresql'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'tmate'
brew 'tmux'
brew 'tmuxinator'
brew 'unrar'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'neovim'
brew 'hub'
brew 'less'
brew 'shellcheck'
brew 'ranger'
brew 'mosh'
brew 'moreutils'
brew 'highlight'
brew 'exa'
brew 'watch'
brew 'rename'
brew 'figlet'
brew 'openssl'
brew 'asciinema'
brew 'asdf'
brew 'nmap'
brew 'mtr'
brew 'sshfs'
brew 'ctop'
brew 'bat'
brew 'entr'
brew 'sox'
brew 'ipython'
brew 'pre-commit'
brew 'fd'
brew 'fasd'
brew 'ccls'
brew 'delta'
brew 'clang-format'

# apps
cask 'vlc'
cask 'slack'
cask 'transmission'
cask 'sublime-text'
cask 'dropbox'
cask 'arq'
cask 'docker'
cask 'pycharm-ce'
cask 'bettertouchtool'
cask 'calibre'
cask 'karabiner-elements'
cask 'spotify'
cask 'telegram'
cask 'the-unarchiver'
cask 'jadengeller-helium'
cask 'virtualbox'
cask 'paw'
cask 'ngrok'
cask 'google-chrome'
cask 'caskroom/versions/google-chrome-canary'
cask 'minikube'
cask 'firefox'
cask 'wireshark'
cask 'hammerspoon'
cask 'dbeaver-community'
cask 'osxfuse'
cask 'ghidra'
cask 'fujitsu-scansnap-manager-s1100'
cask 'steam'
cask 'platypus'
cask 'sourcetrail'
cask 'hex-fiend'

# fonts
cask 'font-inconsolata'
cask 'font-inconsolata-nerd-font'
cask 'font-inconsolata-nerd-font-mono'
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-hack-nerd-font-mono'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
