tap 'burntsushi/ripgrep', 'https://github.com/BurntSushi/ripgrep.git'
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'neovim/neovim'
tap 'thoughtbot/formulae'
tap 'caskroom/fonts'
brew 'ack'
brew 'git'
brew 'bash'
brew 'python3'
brew 'cask'
brew 'cppcheck'
brew 'ctags'
brew 'diff-so-fancy'
brew 'elixir'
brew 'exercism'
brew 'ffmpeg'
brew 'fish'
brew 'fswatch'
brew 'fzf'
brew 'gcc'
brew 'gnutls'
brew 'gnu-typist'
brew 'gnupg'
brew 'go'
brew 'graphviz'
brew 'htop-osx'
brew 'httpie'
brew 'jq'
brew 'mitmproxy'
brew 'mysql'
brew 'netcat'
brew 'node'
brew 'openvpn'
brew 'tree'
brew 'python'
brew 'postgresql'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'tmate'
brew 'tmux'
brew 'unrar'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'neovim/neovim/neovim', args: ['HEAD']
brew 'thoughtbot/formulae/gitsh'
brew 'hub'
brew 'homebrew/dupes/less'
brew 'shellcheck'
brew 'ranger'

# apps
cask 'anybar'
cask 'google-cloud-sdk'
cask 'google-chrome'
cask 'vlc'
cask 'slack'
cask 'transmission'
cask 'sublime-text'
cask 'qlmarkdown'
cask 'dropbox'
cask 'arq'
cask 'docker'
cask 'pycharm'
cask 'intellij-idea'
cask 'bettertouchtool'
cask 'calibre'
cask 'karabiner-elements'
cask 'iterm2'
cask 'sequel-pro'
cask 'spotify'
cask 'telegram'
cask 'the-unarchiver'
cask 'jadengeller-helium'
cask 'flux'
cask 'filezilla'
cask 'vienna'
cask 'virtualbox'
cask 'paw'

# fonts
cask 'font-inconsolata'
cask 'font-inconsolata-nerd-font'
cask 'font-inconsolata-nerd-font-mono'

cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-hack-nerd-font-mono'

cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'

cask 'font-lato'
